Конфигурация/DataProcessors/ОбменДаннымиСДКРегион.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ОбменДаннымиСДКРегион</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/DataProcessors/ОбменДаннымиСДКРегион/Ext/ManagerModule.bsl
Процедура ЗагрузитьДанныеОтДКРегион(Организация, Дата, ПаевойИнвестиционныйФонд, Задача, Отказ) Экспорт
	
	ОбменДаннымиСДК = Обработки.ОбменДаннымиСДКРегион.Создать();
	
	ОбменДаннымиСДК.Дата						= Дата;
	ОбменДаннымиСДК.Организация					= Организация;                                                   
	ОбменДаннымиСДК.ПаевойИнвестиционныйФонд	= ПаевойИнвестиционныйФонд;	
	ОбменДаннымиСДК.Задача						= Задача;
		
	ОбменДаннымиСДК.ЗагрузитьДанные(Отказ);
			
КонецПроцедуры   

Процедура ЗагрузитьСводныеОтчетыОтДКРегионПоИсполненнымОперациямЗаДень(Организация, Дата, Отказ) Экспорт
	
	ОбменДаннымиСДК = Обработки.ОбменДаннымиСДКРегион.Создать();
	
	ОбменДаннымиСДК.Дата						= Дата;
	ОбменДаннымиСДК.Организация					= Организация;                                                   
			
	ОбменДаннымиСДК.ЗагрузитьСводныеОтчетыПоОперациямЗаДень(Отказ);
	
КонецПроцедуры
